Catalogs/ЛичныеДанныеКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЛичныеДанныеКандидатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИООтсутствует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыкаКандидата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыкаКандидата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УченыеСтепени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрисужденияУченойСтепени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиКомпании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗнаниеЯзыковФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗнаниеЯзыковФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньЗнанияЯзыка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛичныеДанныеКандидатов/Ext/ObjectModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наименование на основании фамилии, имени, отчества и уточнения наименования.
Процедура ЗаполнитьНаименованиеПоФИО() Экспорт
	
	Если ФИООтсутствует Или ПустаяСтрока(Фамилия) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", Фамилия, Имя, Отчество);
	
	Наименование = Справочники.ЛичныеДанныеКандидатов.НаименованиеКандидата(СтруктураФИО, УточнениеНаименования);
	
КонецПроцедуры

// Устанавливает пол по отчеству.
Процедура УстановитьПолПоОтчеству() Экспорт
	
	Пол = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПолПоЧастямФИО(ЭтотОбъект);
	
КонецПроцедуры

#Область ЗаполнениеТабличныхЧастей

// Заполняет табличную часть Образование.
// 
// Параметры:
//  ДанныеОбразования - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица
Процедура ЗаполнитьОбразование(ДанныеОбразования) Экспорт
	ЗаполнитьТабличнуюЧасть("Образование", ДанныеОбразования);
КонецПроцедуры

// Заполняет табличную часть Курсы.
// 
// Параметры:
//  ДанныеКурсы - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовыйКурсы
Процедура ЗаполнитьКурсы(ДанныеКурсы) Экспорт
	ЗаполнитьТабличнуюЧасть("Курсы", ДанныеКурсы);
КонецПроцедуры

// Заполняет табличную часть ЗнаниеЯзыков.
// 
// Параметры:
//  ДанныеЗнаниеЯзыков - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовоеЗнаниеЯзыка
Процедура ЗаполнитьЗнаниеЯзыков(ДанныеЗнаниеЯзыков) Экспорт
	ЗаполнитьТабличнуюЧасть("ЗнаниеЯзыков", ДанныеЗнаниеЯзыков);
КонецПроцедуры

// Заполняет табличную часть ОпытРаботы.
// 
// Параметры:
//  ДанныеОпытРаботы - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовыйОпытРаботы
Процедура ЗаполнитьОпытРаботы(ДанныеОпытРаботы) Экспорт
	ЗаполнитьТабличнуюЧасть("ОпытРаботы", ДанныеОпытРаботы);
КонецПроцедуры

// Заполняет табличную часть ОпытРаботы.
// 
// Параметры:
//  ДанныеУченыеСтепени - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НоваяУченаяСтепень
Процедура ЗаполнитьУченыеСтепени(ДанныеУченыеСтепени) Экспорт
	ЗаполнитьТабличнуюЧасть("УченыеСтепени", ДанныеУченыеСтепени);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Обработка заполнения.
// 
// Параметры:
//  ДанныеЗаполнения - Произвольный
//  ТекстЗаполнения - Строка,Неопределено
//  СтандартнаяОбработка - Булево
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ЗаполнитьПоФизическомуЛицу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Кандидаты") Тогда
		ЗаполнитьПоКандидату(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей")
		Или ДополнительныеСвойства.Свойство("ЭтоОтклик") Тогда
		
		ГруппаДоступаИндекс = ПроверяемыеРеквизиты.Найти("ГруппаДоступа");
		Если ГруппаДоступаИндекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ГруппаДоступаИндекс);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаименованиеСлужебное();
	ЗаполнитьЧастиИмени();
	ЗаполнитьИнициалы();
	
	Если ФИООтсутствует И ЗначениеЗаполнено(ФИО) Тогда
		ФИО = "";
	КонецЕсли;
	
	ЗапомнитьРеквизитыПрежнегоСостоянияОбъекта();
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаименованияКандидатов();
	ЗаписатьСвязанныеОбъекты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
Процедура ЗаполнитьПоФизическомуЛицу(ФизическоеЛицоСсылка)

	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ФизическоеЛицоСсылка,
		СтрСоединить(РеквизитыДляЗаполнения(), ","));
		
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФизическогоЛица = КадровыеДанные[0];
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеФизическогоЛица);
	//@skip-check statement-type-change
	//@skip-check property-return-type
	Гражданство = ДанныеФизическогоЛица.Страна;
	ЗаполнитьНаименованиеПоФИО();
	
	ЗаполнитьКонтактнуюИнформациюПоДаннымФизическогоЛица(ФизическоеЛицоСсылка);
	ЗаполнитьЗнаниеЯзыковПоДаннымФизическогоЛица(ФизическоеЛицоСсылка);
	ЗаполнитьОбразованиеПоДаннымФизическогоЛица(ПодборПерсонала.ОбразованиеФизическогоЛица(ФизическоеЛицоСсылка));
	ЗаполнитьУченыеСтепениПоДаннымФизическогоЛица(ДанныеФизическогоЛица);
	ЗаполнитьОпытРаботыПоДаннымФизическогоЛица(ПодборПерсонала.ТрудоваяДеятельностьФизическогоЛица(ФизическоеЛицоСсылка));
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Фотография = Справочники.ЛичныеДанныеКандидатов.КопияФотографииФизическогоЛица(Ссылка, ФизическоеЛицоСсылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоКандидату(Кандидат)
	
	//@skip-check property-return-type
	НаименованиеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат).Наименование; // Строка
	Если ФИООтсутствует Тогда
		Наименование = НаименованиеКандидата;
	Иначе
		ФИО = НаименованиеКандидата;
		ФамилияИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ФамилияИмяОтчество, "Фамилия,Имя,Отчество");
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИменаТабличныхЧастей = Новый Массив; // Массив из Строка
	ИменаТабличныхЧастей.Добавить("Образование");
	ИменаТабличныхЧастей.Добавить("Курсы");
	ИменаТабличныхЧастей.Добавить("ЗнаниеЯзыков");
	ИменаТабличныхЧастей.Добавить("ОпытРаботы");
	ИменаТабличныхЧастей.Добавить("УченыеСтепени");
	
	ИменаРеквизитов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ОбщегоНазначенияБЗККлиентСервер.ВыгрузитьКолонку(ДанныеЗаполнения, "Ключ"), ИменаТабличныхЧастей);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, СтрСоединить(ИменаРеквизитов, ","),
		СтрСоединить(ИменаТабличныхЧастей, ","));
	
	ЗаполнитьЧастиИмени();
	ЗаполнитьНаименованиеПоФИО();
	
	Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
		Если ДанныеЗаполнения.Свойство(ИмяТабличнойЧасти) Тогда
			//@skip-check invocation-parameter-type-intersect
			ЗаполнитьТабличнуюЧасть(ИмяТабличнойЧасти, ДанныеЗаполнения[ИмяТабличнойЧасти]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполнить табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка
//  ДанныеТабличнойЧасти - Массив из Структура
//@skip-check dynamic-access-method-not-found
//@skip-check variable-value-type
Процедура ЗаполнитьТабличнуюЧасть(ИмяТабличнойЧасти, ДанныеТабличнойЧасти)

	ЭтотОбъект[ИмяТабличнойЧасти].Очистить();
	
	Если Не ЗначениеЗаполнено(ДанныеТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ДанныеТабличнойЧасти Цикл
		НоваяСтрока = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьНаименованиеСлужебное()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	НаименованиеСлужебное = ФизическиеЛицаЗарплатаКадры.НаименованиеСлужебное(Наименование);
	
КонецПроцедуры

Процедура ЗаполнитьЧастиИмени()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ФИОУстановлены") Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЧастиИмени, "Фамилия,Имя,Отчество");
	
КонецПроцедуры

Процедура ЗаполнитьИнициалы()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Имя) Тогда
		Инициалы = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыПоИмениОтчеству(Имя, Отчество);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбразованиеПоДаннымФизическогоЛица(ОбразованиеФизическогоЛица)
	
	Образование.Очистить();
	Для Каждого СтрокаОбразование Из ОбразованиеФизическогоЛица Цикл
		ДобавитьДанныеОбОбразованииПоДаннымФизическогоЛица(СтрокаОбразование);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОпытРаботыПоДаннымФизическогоЛица(ТрудоваяДеятельностьФизическогоЛица)
	
	ОпытРаботы.Очистить();
	Для Каждого СтрокаТрудовойДеятельности Из ТрудоваяДеятельностьФизическогоЛица Цикл
		НоваяСтрока = ОпытРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТрудовойДеятельности);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ДанныеФизическогоЛица - СтрокаТаблицыЗначений:
//   * УченаяСтепень - СправочникСсылка.УченыеСтепени
//   * УченаяСтепеньДатаПрисуждения - Дата
Процедура ЗаполнитьУченыеСтепениПоДаннымФизическогоЛица(ДанныеФизическогоЛица)
	
	УченыеСтепени.Очистить();
	Если ЗначениеЗаполнено(ДанныеФизическогоЛица.УченаяСтепень) Тогда
		НоваяСтрока = УченыеСтепени.Добавить();
		НоваяСтрока.УченаяСтепень = ДанныеФизическогоЛица.УченаяСтепень;
		НоваяСтрока.ДатаПрисужденияУченойСтепени = ДанныеФизическогоЛица.УченаяСтепеньДатаПрисуждения;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеОбОбразовании - СтрокаТаблицыЗначений:
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидПослевузовскогоОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * Окончание - Дата
//   * НаименованиеКурса - Строка
//   * ВидДополнительногоОбучения - ПеречислениеСсылка.ВидыПрофессиональнойПодготовки
Процедура ДобавитьДанныеОбОбразованииПоДаннымФизическогоЛица(ДанныеОбОбразовании)
	
	ЭтоДополнительноеОбразование = Справочники.ВидыОбразованияФизическихЛиц.ЭтоДополнительноеОбразование(
		ДанныеОбОбразовании.ВидОбразования, ДанныеОбОбразовании.ВидДополнительногоОбучения);
	
	ГодОкончания = Год(ДанныеОбОбразовании.Окончание);
		
	Если ЭтоДополнительноеОбразование Тогда
		НоваяСтрокаКурсы = Курсы.Добавить();
		НоваяСтрокаКурсы.НаименованиеКурса = ДанныеОбОбразовании.НаименованиеКурса;
		НоваяСтрокаКурсы.УчебноеЗаведение = ДанныеОбОбразовании.УчебноеЗаведение;
		Если ЗначениеЗаполнено(ДанныеОбОбразовании.Окончание) Тогда
			НоваяСтрокаКурсы.ГодОкончания = ГодОкончания;
		КонецЕсли;
	Иначе
		НоваяСтрокаОбразование = Образование.Добавить();
		НоваяСтрокаОбразование.ВидОбразования = ДанныеОбОбразовании.ВидОбразования;
		НоваяСтрокаОбразование.Специальность = ДанныеОбОбразовании.Специальность;
		НоваяСтрокаОбразование.УчебноеЗаведение = ДанныеОбОбразовании.УчебноеЗаведение;
		Если ЗначениеЗаполнено(ДанныеОбОбразовании.Окончание) Тогда
			НоваяСтрокаОбразование.ГодОкончания = ГодОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Процедура ЗаполнитьЗнаниеЯзыковПоДаннымФизическогоЛица(ФизическоеЛицо)
	
	ЗнаниеЯзыков.Очистить();
	
	ВыборкаДетальныеЗаписи = ВыборкаЗнанияЯзыковФизическогоЛица(ФизическоеЛицо);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДобавитьЗнаниеЯзыка(ВыборкаДетальныеЗаписи.Язык, ВыборкаДетальныеЗаписи.СтепеньЗнанияЯзыка);
	КонецЦикла;
	
КонецПроцедуры

// Выборка знания языков физического лица.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//   * Язык - СправочникСсылка.ЯзыкиНародовМира
//   * СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыка
Функция ВыборкаЗнанияЯзыковФизическогоЛица(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗнаниеЯзыковФизическихЛиц.Язык КАК Язык,
		|	ЗнаниеЯзыковФизическихЛиц.СтепеньЗнанияЯзыка КАК СтепеньЗнанияЯзыка
		|ИЗ
		|	РегистрСведений.ЗнаниеЯзыковФизическихЛиц КАК ЗнаниеЯзыковФизическихЛиц
		|ГДЕ
		|	ЗнаниеЯзыковФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  Язык - СправочникСсылка.ЯзыкиНародовМира
//  СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыка
Процедура ДобавитьЗнаниеЯзыка(Язык, СтепеньЗнанияЯзыка)
	
	НоваяСтрока = ЗнаниеЯзыков.Добавить();
	НоваяСтрока.Язык = Язык;
	Если ЗначениеЗаполнено(СтепеньЗнанияЯзыка) Тогда
		НоваяСтрока.СтепеньЗнанияЯзыкаКандидата =
			Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаКандидатаПоСтепениЗнанияЯзыка(
			СтепеньЗнанияЯзыка);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//@skip-check statement-type-change
//@skip-check invocation-parameter-type-intersect
//@skip-check wrong-type-expression
Процедура ЗаполнитьКонтактнуюИнформациюПоДаннымФизическогоЛица(ФизическоеЛицо)
	
	КИФизическогоЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизическоеЛицо, , , Ложь);
	Если КИФизическогоЛица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКИ = ПодборПерсонала.ВидыКИКандидатовПоКИФизическихЛиц(); // Соответствие
	КИКандидата = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	Для Каждого ТекущаяСтрока Из КИФизическогоЛица Цикл
		
		ВидКИФизическогоЛица = ТекущаяСтрока.Вид;
		ВидКИКандидата = СоответствиеКИ.Получить(ВидКИФизическогоЛица);
		Если ВидКИКандидата = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = КИКандидата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Объект = ЭтотОбъект;
		НоваяСтрока.Вид = ВидКИКандидата;
			
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ЭтотОбъект, КИКандидата);
	
КонецПроцедуры

Функция РеквизитыДляЗаполнения()
	
	ИменаРеквизитов = Новый Массив; // Массив из Строка
	ИменаРеквизитов.Добавить("ФИО");
	ИменаРеквизитов.Добавить("Фамилия");
	ИменаРеквизитов.Добавить("Имя");
	ИменаРеквизитов.Добавить("Отчество");
	ИменаРеквизитов.Добавить("Инициалы");
	ИменаРеквизитов.Добавить("ИНН");
	ИменаРеквизитов.Добавить("СтраховойНомерПФР");
	ИменаРеквизитов.Добавить("Пол");
	ИменаРеквизитов.Добавить("ДатаРождения");
	ИменаРеквизитов.Добавить("МестоРождения");
	ИменаРеквизитов.Добавить("ИмеетНаучныеТруды");
	ИменаРеквизитов.Добавить("ИмеетИзобретения");
	ИменаРеквизитов.Добавить("СостояниеВБраке");
	ИменаРеквизитов.Добавить("Страна");
	ИменаРеквизитов.Добавить("ВладеемыйЯзык1");
	ИменаРеквизитов.Добавить("ВладеемыйЯзык1СтепеньЗнания");
	ИменаРеквизитов.Добавить("ВладеемыйЯзык2");
	ИменаРеквизитов.Добавить("ВладеемыйЯзык2СтепеньЗнания");
	ИменаРеквизитов.Добавить("УченаяСтепень");
	ИменаРеквизитов.Добавить("УченаяСтепеньДатаПрисуждения");
	
	Возврат ИменаРеквизитов;
	
КонецФункции

//@skip-check invocation-parameter-type-intersect
Процедура ЗапомнитьРеквизитыПрежнегоСостоянияОбъекта()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = ОбщегоНазначения.ВыгрузитьКолонку(
		Метаданные.Справочники.ЛичныеДанныеКандидатов.Реквизиты, "Имя"); // Массив из Строка
	ИменаРеквизитов.Добавить("Наименование");
	
	ПрежниеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрСоединить(ИменаРеквизитов, ",")); 
	ПрежниеЗначения.Вставить("ТаблицаКИ", Новый ФиксированныйМассив(Новый Массив));
	ПрежниеЗначения.Вставить("МобильныйТелефон", "");
	ПрежниеЗначения.Вставить("ЭлектроннаяПочта", "");
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка,,,Ложь);
	
	Если ЗначениеЗаполнено(ТаблицаКИ) Тогда
		ПрежниеЗначения.ТаблицаКИ = ОбщегоНазначения.ФиксированныеДанные(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаКИ));
		
		НайденнаяСтрокаТелефон = ТаблицаКИ.Найти(ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"), "Вид");
		Если НайденнаяСтрокаТелефон <> Неопределено Тогда
			ПрежниеЗначения.МобильныйТелефон = НайденнаяСтрокаТелефон.Представление;
		КонецЕсли;
		
		НайденнаяСтрокаЭлектроннаяПочта = ТаблицаКИ.Найти(ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"), "Вид");
		Если НайденнаяСтрокаЭлектроннаяПочта <> Неопределено Тогда
			ПрежниеЗначения.ЭлектроннаяПочта = НайденнаяСтрокаЭлектроннаяПочта.Представление;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежниеЗначения", ПрежниеЗначения);
	
КонецПроцедуры

Процедура ОбновитьНаименованияКандидатов() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ПрежниеЗначения") Тогда
		//@skip-check property-return-type
		ПрежнееНаименование = ДополнительныеСвойства.ПрежниеЗначения.Наименование; // Строка
	Иначе
		ПрежнееНаименование = "";
	КонецЕсли;
	
	Если Наименование = ПрежнееНаименование Тогда
		Возврат;
	КонецЕсли;
	
	Кандидаты = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка), Ложь).ВыгрузитьКолонку("Кандидат"); // Массив из СправочникСсылка.Кандидаты
	ИсключаемыйКандидат = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЗаписываемыйКандидат");
	
	Для Каждого Кандидат Из Кандидаты Цикл
		
		Если Кандидат = ИсключаемыйКандидат Тогда
			Продолжить;
		КонецЕсли;
		
		КандидатОбъект = Кандидат.ПолучитьОбъект();
		ПрежнееНаименованиеКандидата = КандидатОбъект.Наименование;
		КандидатОбъект.ЗаполнитьНаименованиеПоДаннымКандидата(ЭтотОбъект);
		Если КандидатОбъект.Наименование <> ПрежнееНаименованиеКандидата Тогда
			Попытка 
				КандидатОбъект.Заблокировать();
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось изменить наименование у кандидата %1.
					|Возможно, данные редактируются другим пользователем'"),
					ПрежнееНаименованиеКандидата);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			КандидатОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//@skip-check property-return-type
//@skip-check invocation-parameter-type-intersect
Процедура ЗаписатьСвязанныеОбъекты()
	
	Если Не ДополнительныеСвойства.Свойство("СвязанныеОбъекты") Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеОбъекты = ДополнительныеСвойства.СвязанныеОбъекты; // Структура
	
	Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвязанныеОбъекты, "ФизическоеЛицоСсылка")) Тогда
		ОбработатьСвязанноеФизическоеЛицо(СвязанныеОбъекты.ФизическоеЛицоСсылка);
	КонецЕсли;
	
	ДополнительныеСвойства.Удалить("СвязанныеОбъекты");
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//@skip-check invocation-parameter-type-intersect
//@skip-check property-return-type
Процедура ОбработатьСвязанноеФизическоеЛицо(ФизическоеЛицо)
	
	Если ДополнительныеСвойства.Свойство("ДанныеДляЗаполненияИзАрхива") Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц") Тогда
			МодульАрхивФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АрхивФизическихЛиц");
			МодульАрхивФизическихЛиц.ОбновитьФизическоеЛицоПоДаннымИзАрхива(ФизическоеЛицо,
				ДополнительныеСвойства.ДанныеДляЗаполненияИзАрхива);
		КонецЕсли;
		ДополнительныеСвойства.Удалить("ДанныеДляЗаполненияИзАрхива");
	КонецЕсли;
	
	РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(Ссылка, ФизическоеЛицо);
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
